---
kind: property
id: P:Autodesk.Revit.DB.Viewport.Rotation
source: html/abd81744-b44a-e578-cb62-3cc40a334acc.htm
---
# Autodesk.Revit.DB.Viewport.Rotation Property

The rotation of the viewport on the sheet.

## Syntax (C#)
```csharp
public ViewportRotation Rotation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration